package com.feefield.kotlincourse.lesson03

// Hackathon Survival
//Для каждого из полей подбери наилучший способ хранения из известных тебе.
//Учитывай такие факторы, как изменяемость, обязательность, возможность начальной установки, ресурсоёмкие вычисления значения,
//необходимость проверки устанавливаемого значения на валидность или запрет доступа на установку при возможности чтения,
//публичность и приватность данных.


// Название мероприятия:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Дата проведения:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Место проведения:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Подробный бюджет мероприятия:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Количество участников:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Длительность хакатона:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Текущее состояние хакатона:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Список спонсоров:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Бюджет мероприятия:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// План эвакуации:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность:





// Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия:

// -- изменяемость:

// -- обязательность:

//-- возможность начальной установки:

//-- ресурсоёмкие вычисления значения:

//-- необходимость проверки:

//-- запрет доступа на установку:

//-- публичность: